In [1]:
# Pandas is the module work with series and dataframe
import pandas as pd
import numpy as np
# reference strongly recommended: 10 Minutes to pandas
# https://pandas.pydata.org/pandas-docs/stable/10min.html

Data Struture in Pandas:
    
![alt text](screenshots/acafadfcsdfvsv.PNG)

## Series Basic

In [32]:
# create a series from dictionary
sport= {'USA':'soccer', 'Europe':'football','China':'table tennis'}
sport= pd.Series(sport)
print(sport)

# create series directly
sport= pd.Series(['soccer','football','table tennis'],index = ['USA', 'Europe','China'])
print(sport)

China     table tennis
Europe        football
USA             soccer
dtype: object
USA             soccer
Europe        football
China     table tennis
dtype: object
Index(['USA', 'Europe', 'China'], dtype='object')
football
football

In [33]:
print(sport.index)

#select by position
print(sport[1])
print(sport.iloc[1])

#select by label
print(sport['China'])
print(sport.loc['China'])

Index(['USA', 'Europe', 'China'], dtype='object')
football
football
table tennis
table tennis

In [17]:
#Missing value 
animal= ['bear','panda','wolf',None]
animal= pd.Series(animal)
print(animal)  

#when None goes in numbers, it becomes NaN (Not a Number)
print(pd.Series([1,2,3,None]))

print(np.NaN == None)
print(np.NaN == np.NaN)
#you can't use = to measure NaN
print(np.isnan(np.NaN))

0     bear
1    panda
2     wolf
3     None
dtype: object
0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64
False
False
True

## DataFrame  Basic

In [2]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [3]:
#select a row
print(df.loc['Store 2'])     #return a series
print(df.loc['Store 1'])     #return a new dataframe

print(df.loc['Store 1', 'Name'])

Cost                      5
Item Purchased    Bird Seed
Name                  Vinod
Name: Store 2, dtype: object
         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 1    Chris
Store 1    Kevyn
Name: Name, dtype: object

In [4]:
# select a column
print(df['Cost'])
print(df.loc['Store 1']['Cost'])

print(df.loc[:,['Name','Cost']])

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64
Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64
          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [5]:
print(df.T)

                 Store 1       Store 1    Store 2
Cost                22.5           2.5          5
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Name               Chris         Kevyn      Vinod

In [6]:
#drop a row
df_drop=df.drop('Store 1')
print(df_drop)
df  #drop function doesn't change df itself

         Cost Item Purchased   Name
Store 2   5.0      Bird Seed  Vinod

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [7]:
#drop a column
del df['Name']
df # del change df itself

         Cost Item Purchased
Store 1  22.5       Dog Food
Store 1   2.5   Kitty Litter
Store 2   5.0      Bird Seed

In [8]:
# add a column
df['Location'] = None
df

         Cost Item Purchased Location
Store 1  22.5       Dog Food     None
Store 1   2.5   Kitty Litter     None
Store 2   5.0      Bird Seed     None

In [9]:
#missing value

#input manually
df.iat[0,2] = 'China'
print(df)

# forward fill missing value
df.fillna(method='ffill', inplace=True)
df

         Cost Item Purchased Location
Store 1  22.5       Dog Food    China
Store 1   2.5   Kitty Litter     None
Store 2   5.0      Bird Seed     None

         Cost Item Purchased Location
Store 1  22.5       Dog Food    China
Store 1   2.5   Kitty Litter    China
Store 2   5.0      Bird Seed    China

In [30]:
#cumulative sum 
df.apply(np.cumsum)

                        Item Purchased  Cost         Location
store
Store 1                       Dog Food  22.5            China
Store 1           Dog FoodKitty Litter  25.0       ChinaChina
Store 2  Dog FoodKitty LitterBird Seed  30.0  ChinaChinaChina

In [35]:
# calculate value range 
sub_df = pd.DataFrame(df['Cost'])

sub_df.apply(lambda x: x.max() - x.min())

Cost    20.0
dtype: float64

In [40]:
# frequency 
df['Location'].value_counts()

China    3
Name: Location, dtype: int64

In [41]:
# upper case
df['Location'].str.upper()

store
Store 1    CHINA
Store 1    CHINA
Store 2    CHINA
Name: Location, dtype: object

In [10]:
# change index
df['store'] = df.index
print(df)
df =df.set_index('Item Purchased')
df

         Cost Item Purchased Location    store
Store 1  22.5       Dog Food    China  Store 1
Store 1   2.5   Kitty Litter    China  Store 1
Store 2   5.0      Bird Seed    China  Store 2

                Cost Location    store
Item Purchased
Dog Food        22.5    China  Store 1
Kitty Litter     2.5    China  Store 1
Bird Seed        5.0    China  Store 2

In [11]:
#remove index
df =df.reset_index()
df

  Item Purchased  Cost Location    store
0       Dog Food  22.5    China  Store 1
1   Kitty Litter   2.5    China  Store 1
2      Bird Seed   5.0    China  Store 2

In [12]:
# multi-level index
df =df.set_index(['store','Item Purchased'])
df

                        Cost Location
store   Item Purchased
Store 1 Dog Food        22.5    China
        Kitty Litter     2.5    China
Store 2 Bird Seed        5.0    China

In [13]:
# select value in multi-level index
print(df.loc['Store 1','Dog Food' ])

#if you want to select multiple value , use a list of tuple
df.loc[[('Store 1','Dog Food'),('Store 1','Kitty Litter') ]]

Cost         22.5
Location    China
Name: (Store 1, Dog Food), dtype: object

                        Cost Location
store   Item Purchased
Store 1 Dog Food        22.5    China
        Kitty Litter     2.5    China

## Filter data: Boolean Mask

In [14]:
df =df.reset_index()
df= df.set_index('store')
df

        Item Purchased  Cost Location
store
Store 1       Dog Food  22.5    China
Store 1   Kitty Litter   2.5    China
Store 2      Bird Seed   5.0    China

In [15]:
df['Cost'] > 10

store
Store 1     True
Store 1    False
Store 2    False
Name: Cost, dtype: bool

In [16]:
sub_df = df.where(df['Cost'] > 10)
sub_df

        Item Purchased  Cost Location
store
Store 1       Dog Food  22.5    China
Store 1            NaN   NaN      NaN
Store 2            NaN   NaN      NaN

In [17]:
print(df['Cost'].count())
print(sub_df['Cost'].count())

3
1

In [18]:
sub_df = sub_df.dropna()
sub_df

        Item Purchased  Cost Location
store
Store 1       Dog Food  22.5    China

In [19]:
# a quicker way to use boolean mask
sub_df = df[df['Cost'] > 10]
sub_df

        Item Purchased  Cost Location
store
Store 1       Dog Food  22.5    China

In [20]:
print('need to use () for each boolean mask')

#and
sub_df =df[(df['Cost'] > 10) & (df['Item Purchased'] == 'Kitty Litter')]
sub_df

need to use () for each boolean mask

Empty DataFrame
Columns: [Item Purchased, Cost, Location]
Index: []

In [21]:
#or
sub_df =df[(df['Cost'] > 10) | (df['Item Purchased'] == 'Kitty Litter')]
sub_df

        Item Purchased  Cost Location
store
Store 1       Dog Food  22.5    China
Store 1   Kitty Litter   2.5    China

In [22]:
df[df['Cost'].isin([2.5,5.0])]

        Item Purchased  Cost Location
store
Store 1   Kitty Litter   2.5    China
Store 2      Bird Seed   5.0    China

In [25]:
# set to ordinal data
s = pd.Series(['Low', 'Low', 'High', 'Medium', 'Low', 'High', 'Low'])

s.astype('category', categories=['Low', 'Medium', 'High'], ordered=True)

0       Low
1       Low
2      High
3    Medium
4       Low
5      High
6       Low
dtype: category
Categories (3, object): [Low < Medium < High]

In [28]:
print('now you can compare data, because it has sequence')
s >= 'Medium'

now you can compare data, because it has sequence

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [31]:
# set category to numerical data
s = pd.Series([168, 180, 174, 190, 170, 185, 179, 181, 175, 169, 182, 177, 180, 171])

# You can also add labels for the sizes [Small < Medium < Large].
pd.cut(s, 3, labels=['Small', 'Medium', 'Large'])

0      Small
1     Medium
2      Small
3      Large
4      Small
5      Large
6     Medium
7     Medium
8      Small
9      Small
10    Medium
11    Medium
12    Medium
13     Small
dtype: category
Categories (3, object): [Small < Medium < Large]

## Merge

In [7]:
Student = pd.DataFrame([{'Name': 'Peter', 'class': 1,"Score": 96},
                        {'Name': 'Nate', 'class': 2,"Score": 60},
                        {'Name': 'Paul', 'class': 2,"Score": 80}])
Class = pd.DataFrame([{'Classroom': 102, 'classes': 1},
                      {'Classroom': 204, 'classes': 2},
                      {'Classroom': 306, 'classes': 3}])

In [8]:
df = pd.merge(Student,Class, left_on = 'class',right_on = 'classes', how = 'inner')
df

    Name  Score  class  Classroom  classes
0  Peter     96      1        102        1
1   Nate     60      2        204        2
2   Paul     80      2        204        2

In [45]:
#check how values changes row by row
df.set_index("Name").diff()

       Score  class  Classroom  classes
Name
Peter    NaN    NaN        NaN      NaN
Nate   -36.0    1.0      102.0      1.0
Paul    20.0    0.0        0.0      0.0

## Group By

In [16]:
#group all columns
df.groupby('class').sum()

       Score  Classroom  classes
class
1         96        102        1
2        140        408        4

In [17]:
# return one column data
df.groupby('class').agg({'Score': np.average})

       Score
class
1         96
2         70

In [22]:
#return multiple columns
df.groupby('class')['Score','Classroom'].agg({'avg': np.average,'sum':np.sum})

E:\python\lib\site-packages\pandas\core\groupby.py:4036: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

        sum             avg
      Score Classroom Score Classroom
class
1        96       102    96       102
2       140       408    70       204

In [10]:
# create a new column
df.groupby('class')['Score'].agg({'avg': np.average})

E:\python\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  if __name__ == '__main__':

       avg
class
1       96
2       70

## Dummy Variable

In [30]:
#dummy all string variables
pd.get_dummies(df)

   Score  class  Classroom  classes  Name_Nate  Name_Paul  Name_Peter
0     96      1        102        1          0          0           1
1     60      2        204        2          1          0           0
2     80      2        204        2          0          1           0

In [35]:
#only want one column?
df_name = pd.get_dummies(df['Name'])
df_name

   Nate  Paul  Peter
0     0     0      1
1     1     0      0
2     0     1      0

In [37]:
df_new = pd.concat([df, df_name], axis=1)
df_new

    Name  Score  class  Classroom  classes  Nate  Paul  Peter
0  Peter     96      1        102        1     0     0      1
1   Nate     60      2        204        2     1     0      0
2   Paul     80      2        204        2     0     1      0

## Pivot Table

In [38]:
df

    Name  Score  class  Classroom  classes
0  Peter     96      1        102        1
1   Nate     60      2        204        2
2   Paul     80      2        204        2

In [40]:
df.pivot_table(index= 'Name', columns = 'class')

      Classroom        Score       classes
class         1      2     1     2       1    2
Name
Nate        NaN  204.0   NaN  60.0     NaN  2.0
Paul        NaN  204.0   NaN  80.0     NaN  2.0
Peter     102.0    NaN  96.0   NaN     1.0  NaN

In [41]:
df.pivot_table(index= ['Name' ,'class'])

             Classroom  Score  classes
Name  class
Nate  2            204     60        2
Paul  2            204     80        2
Peter 1            102     96        1

In [43]:
df.pivot_table(index= 'Name', columns = 'class',aggfunc= np.min ,margins = True)

      Classroom               Score             classes
class         1      2    All     1     2   All       1    2  All
Name
Nate        NaN  204.0  204.0   NaN  60.0  60.0     NaN  2.0  2.0
Paul        NaN  204.0  204.0   NaN  80.0  80.0     NaN  2.0  2.0
Peter     102.0    NaN  102.0  96.0   NaN  96.0     1.0  NaN  1.0
All       102.0  204.0  102.0  96.0  60.0  60.0     1.0  2.0  1.0

## Efficiency: executing time

In [3]:
%%timeit -n 100

total = 0
for i in pd.Series([1,2,3]):
    total = total + i

The slowest run took 10.97 times longer than the fastest. This could mean that an intermediate result is being cached.
100 loops, best of 3: 123 s per loop

In [7]:
%%timeit -n 100
np.sum(pd.Series([1,2,3]))

100 loops, best of 3: 169 s per loop

## Import and Export

In [ ]:
# csv file
df = pd.read_csv('zzz.txt', header = 0, skiprows = 1)
df= df.to_csv('foo.csv')

![alt text](screenshots/IMG_0929.PNG)